{"id":"39574184","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data Scientist","insider_interview":null,"response_letter_required":false,"area":{"id":"112","name":"Ярославль","url":"https://api.hh.ru/areas/112?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Ярославль","street":"Технопарковая улица","building":"9","description":null,"lat":57.554653,"lng":39.898826,"raw":"Ярославль, Технопарковая улица, 9","metro":null,"metro_stations":[]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Job Description:</strong></p> <p>Are you looking for a patient-focused, innovation-driven company that will inspire you and support your career? If so, take charge of your future and join our local Digital Solution and Business Excellence team and our global Data Analytics team as a Data Scientist in Takeda Pharmaceutical Plant in Yaroslavl, Russia.</p> <p> </p> <p>POSITION OBJECTIVES:</p> <ul> <li>Translate data science, artificial intelligence and machine learning trends and technologie into execution.</li> <li>Apply machine learning, deep learning and other advanced techniques while performing Data Analysis engagements.</li> <li>Independently perform complex analysis using modern Data Science techniques against structured or unstructured data to generate insights.</li> <li>Deliver critical analysis against Takeda’s toughest data problems to give us critical insight to the organization’s largest questions.</li> <li>Help us staying at the forefront of technical advancement in data science and introducing cutting edge tools and techniques for generating business insights.</li> <li>Continuously develop and present innovative ideas based on data driven approach in order to improve business processes.</li> </ul> <p> </p> <p>POSITION ACCOUNTABILITIES:</p> <ul> <li>Manages and drives local process monitoring and process improvement in collaboration with global GMSdata science (e.g. descriptive statistics and visualization, statistical process control, out-of-the-box-tools) and AGILE/Operational Excellence team.</li> <li>Role requires partnership with local functions, IT, Engineering, Quality and Global Data Science team.</li> <li>Partnership across local, functional and global GMS Data Science, IT, Engineering.</li> </ul> <p> </p> <p>EDUCATION, BEHAVIORAL COMPETENCIES AND SKILLS:</p> <p><em>Qualifications:</em></p> <ul> <li>University degree of science/business (engineering, computer science, statistics, applied mathematics or other related fields).</li> <li>Experience in Digital/Big Data Analytics/ Artificial Intelligence/Machine.</li> <li>Learning algorithms, respective programming knowledge.</li> <li>2+ years of experience of relevant experience in data, analytics and statistics or equivalent academic experience/course record.</li> <li>Hands-on experience in applying and executing Artificial Intelligence/Deep Learning, Machine Learning, Big Data and Digital with respective programming knowledge.</li> </ul> <p> </p> <p><em>Technical Skills:</em></p> <ul> <li>Understanding of algorithms and ability to optimize various program complexities using suitable data structures.</li> <li>Ability to define and support the quality assurance cycle.</li> <li>Experience in model management, automation of the processes of publication and monitoring.</li> <li>Experience designing and building new data products is an advantage.</li> <li>Experience working with complex spreadsheet software and analysis and putting together presentations in a compelling and visual way.</li> <li>Advanced Power BI and PowerPoint presentation skills.</li> <li>Experience with process analytical technologies, process modelling, or continuous manufacturing will be a plus.</li> <li>Well versed with statistical design and analysis.</li> </ul> <p> </p> <p><em>Business Skills:</em></p> <ul> <li>Experience applying analytics and creating innovative solutions to solve business problems.</li> <li>Good business acumen to orient data analysis to business needs of clients.</li> <li>Strong written, verbal, and graphical communication skills.</li> <li>Experience in presenting ideas and analysis to various audience levels.</li> <li>Ability to clearly communicate the meaning of analytical concepts, analyses and results.</li> <li>Quick-thinker, fast learner, wide general knowledge, problem solver.</li> <li>Analytical and Problem-Solving Skills - Able to troubleshoot critical issues or problems using appropriate information and, determine causes and possible solutions</li> <li>Team worker, responsible, results-oriented.</li> <li>Ability to work well on global cross-functional teams.</li> <li>Able to expresses one’s self clearly and concisely within team; communicates issues and/or concerns concisely with colleagues; adjusts communication style as appropriate for the audience; timely and effectively communicates with senior management.</li> <li>Exercises good time management and prioritization skills to balance multiple project and departmental objectives.</li> <li>Ability to execute multiple projects and tasks with competing priorities while meeting required deadlines.</li> <li>Project management skills; ability to manage one’s time within individual, departmental, and corporate goals and timelines.</li> <li>Ability to capture knowledge within the organization; improves solutions, processes, and deliverables through use of information; improves information capital by contributing experience, theories, deliverables, and models for others to use.</li> <li>Fluent English.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.50","name":"Системы управления предприятием (ERP)","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.420","name":"Администратор баз данных","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.246","name":"Развитие бизнеса","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.536","name":"CRM системы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"910582","name":"Производственная компания Такеда","url":"https://api.hh.ru/employers/910582?host=hh.ru","alternate_url":"https://hh.ru/employer/910582","logo_urls":{"90":"https://hhcdn.ru/employer-logo/861350.jpeg","240":"https://hhcdn.ru/employer-logo/861351.jpeg","original":"https://hhcdn.ru/employer-logo-original/114051.jpg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=910582&host=hh.ru","trusted":true},"published_at":"2020-11-30T17:38:01+0300","created_at":"2020-11-30T17:38:01+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=39574184","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/39574184","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}