{"id":"40539655","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Lead Sales Representative, Power Quality, Data Center","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"direct","name":"Рекламная"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Company description:</strong></p> <p>Eaton’s mission is to improve the quality of life and the environment through the use of power management technologies and services. We provide sustainable solutions that help our customers effectively manage electrical, hydraulic, and mechanical power – more safely, more efficiently, and more reliably. Eaton’s 2019 revenues were $21.4 billion, and we sell products to customers in more than 175 countries. We have approximately 101,000 employees. For more information, visit www.eaton.com.</p> <p><strong>Job description:</strong></p> <p>Do you want to work for a global company where promoting gender equality is central to our vision of creating a truly diverse and inclusive business? Where everyone matters, and everyone belongs.<br /><br />As a<strong> Lead Sales Representative, Data Center Segment, Russia and Kazakhstan</strong> you will be responsible for the development of the Data Centre’s segment, where turnover is measured by system integrators sales, sales profitability, and customer satisfaction, growth and expansion in fixed market segments - Data Center (Russia and Kazakhstan)<br /><br /><strong>Your main duties: </strong><br /><br />You will develop an effective effective strategy in the Data Center segment<br />• Execute the sales revenue target in the data center market segment<br />• Develop projects pipeline in the datacenter market segment by further penetrating with innovative technical and services solutions<br />•Implement an effective key account management focusing on big system integrators, consultants and investors’ to increase the win rate of projects<br />• Build a strong partnership with customers through daily interaction with operations and engineering team<br />• Initiate, develops and facilitate customers trainings, facilitate the technical design meetings together with local engineering team<br />• Contribute to the implementation of specific activities for focused customers in collaboration with the local and corporate team(marketing, partnership programs, technical engineering)<br />•C ollaborate with other divisions of the company to implement best practices<br />•Provide leadership of the sales activities in the Data Center segment through effective collaboration with Moscow and regional team (functional management)</p> <p><strong>Required profile:</strong></p> <p><strong>What we are looking for:</strong><br /><br />• Bachelor’s degree in engineering<br />• Advanced technical skills IT related<br />• Strong sales experience<br />• Project Management Experience<br />• Ability to identify and convert projects opportunities in sales<br />• Strong communication skills, both verbal and written, an absolute must; formal presentation skills a definite plus<br />• Ability to accomplish results in a cross-functional team environment, exhibiting formal and informal leadership skills and a<br />• Co-operation skills (customers and own personnel), teamwork, goodwill<br />• English-advanced</p> <p><strong>What we offer:</strong></p> <p>• At Eaton, inclusion and diversity is our strength. We embrace the power of many perspectives to drive innovation and growth that benefits our people, investors, customers and communities.<br />• Learning &amp; Development - We invest in our employees for the long term – not just with salary and benefits, but with ongoing learning and development opportunities made available through Eaton University<br />• Great promotional opportunities – We encourage internal promotion, whenever possible<br />• Culture &amp; Values – We are more than the products we invent and produce – the way we do business is just as important. At Eaton, our values and culture define who we are – both individually and as an organization – and direct our activities every day</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":"https://stats.the-network.com/redirect/de1ffd9d-54cb-421c-b42d-765eb0100c28","specializations":[{"id":"17.149","name":"Менеджер по работе с клиентами","profarea_id":"17","profarea_name":"Продажи"}],"code":"104039","hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"633895","name":"Eaton Corporation","url":"https://api.hh.ru/employers/633895?host=hh.ru","alternate_url":"https://hh.ru/employer/633895","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/160989.gif","240":"https://hhcdn.ru/employer-logo/1090080.png","90":"https://hhcdn.ru/employer-logo/1090079.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=633895&host=hh.ru","trusted":true},"published_at":"2020-11-19T23:49:12+0300","created_at":"2020-11-19T23:49:12+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=40539655","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/40539655","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}