{"id":"40725216","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Data engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":null,"street":null,"building":null,"description":null,"lat":null,"lng":null,"raw":null,"metro":{"station_name":"Улица 1905 года","line_name":"Таганско-Краснопресненская","station_id":"7.146","line_id":"7","lat":55.763944,"lng":37.562271},"metro_stations":[{"station_name":"Улица 1905 года","line_name":"Таганско-Краснопресненская","station_id":"7.146","line_id":"7","lat":55.763944,"lng":37.562271}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>inDriver</strong> — международный сервис пассажирских перевозок. Мы создаем глобальный высокотехнологичный продукт, который меняет жизнь миллионов людей к лучшему. Входим в топ-3 мобильных сервисов для заказа поездок — 50 млн. пользователей, 550 млн. поездок, 300 городов в 31 стране мира.</p> <p><strong>Мы ищем классного Data инженера</strong>, который поможет строить Data Warehouse, с data quality и блекджеком, будет участвовать в построении архитектуры и моделировании данных, делиться знаниями и получать эти знания. Мы только начинаем строить новый Data Warehouse, наращиваем команду, но мы знаем, что эта часть проекта является одной из важнейший частей продукта.</p> <p>‍‍‍ В команде разработки более 100 человек и мы продолжаем расширять команду. Из них 3ое Data Engineerы, есть DevOps и Ops инженеры.</p> <p>Мы не боимся использовать новые инфраструктурные решения (Google Cloud Platform, AWS). Мы свободны в принятии решений, будучи ограничены только законами о защите перс данных. Инфраструктурные и архитектурные решения принимаем исключительно с трезвым взглядом на проблему и апеллируя к цифрам.</p> <p>Используем Python/Scala для разработки под Spark, Python/Java для написания сервисов, BigQuery/Clickhouse как OLAP СУБД, Spark/DataFlow для обработки данных. Визуализируем в Grafana/Tableau. Разработку ведем на Github, используем TeamCity, трекам задачи в JIra, доку пишем в Confluence. Хотим развиваться в сторону Flink, Kubernetes (в том числе Spark on Kubernetes), Kafka, но открыты к любым идеям и решениям.</p> <p><strong>Наши пожелания:</strong></p> <ul> <li>Имеете опыт разработки Data pipelineов на Spark/Flink/DataFlow с применением Luigi/Airflow/Oozie;</li> <li>Владеете Python и Java;</li> <li>Знаете и понимаете алгоритмы и принципов обработки данных;</li> <li>️Понимаете общие концепции программирования (шаблоны проектирования, ООП, модульность, чистая архитектура, 12-Factor App);</li> <li>Умеете проектировать систему обработки данных (data modeling);</li> <li>Ответственны и инициативны (мы верим, что идеи должны исходить не только от бизнеса, но и от сотрудников компании);</li> <li>‍Любите учиться и развиваться (мы будем регулярно отправлять на курсы).</li> </ul> <p><strong>Вам предстоит:</strong></p> <ul> <li>‍Развивать культуру работы с данными;</li> <li>Создавать единую систему обработки, хранения и валидации данных;</li> <li>‍Проектировать и строить процессы хранения, обработки, очистки и обогащения данных;</li> <li>‍Участвовать в разработке data pipeline на всех этапах - от обсуждения с источниками данных формата получения данных, до презентации новой фичи потребителям;</li> <li>Разрабатывать API (REST, gRPC) для высоконагруженных сервисов получения доступа к данным;</li> <li>Участвовать в проектировании системы и принятии архитектурных решений совместно с командой разработки;</li> <li>Писать интеграционные и юнит-тесты, разрабатывать средства автоматизации для валидации и алертинга на основе состояния данных;</li> <li>А также делиться знаниями с разработчиками на внутренних митапах.</li> </ul> <p><strong>Мы предлагаем:</strong></p> <ul> <li>Стабильную заработную плату, соблюдение ТК РФ, ДМС со стоматологией;</li> <li>Современные MacBook Pro и другое необходимое для работы оборудование;</li> <li>‍Неограниченные возможности профессионального и карьерного роста, регулярное внешнее и внутреннее обучение от наших партнеров;</li> <li>Частично или полностью оплачиваемые дополнительные обучающие курсы, занятия английским языком с преподавателем в офисе;</li> <li>Программы личностного роста, в которых мы ставим цели и вместе к ним движемся;</li> <li>Возможность стать частью международной команды профессионалов и просто хороших людей, которые все вместе создают одну из самых крутых историй успеха в мировой IT-индустрии;</li> <li>Перевезем вас в Москву и предоставим релокационный пакет.</li> </ul> <p><strong>Наши сотрудники - самое ценное, что у нас есть</strong>. Мы заботимся о том, чтобы офисное пространство было максимально комфортным для работы и отдыха. В офисе есть уютная кухня, игровая комната и зоны для отдыха. Мы любим различные корпоративные мероприятия и тематические дни, чтобы наша жизнь была еще более интересной и насыщенной.</p> <p>Офис находится в нескольких минутах ходьбы от м. Улица 1905 года.</p> <p><em>Мы заботимся о здоровье сотрудников, поэтому сейчас работаем удаленно из разных городов. Компания предоставляет все необходимое оборудование для удаленной работы, доставим курьером в первый рабочий день.</em></p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Java"},{"name":"SQL"},{"name":"Git"},{"name":"Atlassian Jira"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2524797","name":"inDriver","url":"https://api.hh.ru/employers/2524797?host=hh.ru","alternate_url":"https://hh.ru/employer/2524797","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/702160.png","90":"https://hhcdn.ru/employer-logo/3249756.png","240":"https://hhcdn.ru/employer-logo/3249757.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2524797&host=hh.ru","trusted":true},"published_at":"2020-12-04T11:04:00+0300","created_at":"2020-12-04T11:04:00+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=40725216","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/40725216","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}