{"id":"40496929","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data Scientist","insider_interview":null,"response_letter_required":false,"area":{"id":"1002","name":"Минск","url":"https://api.hh.ru/areas/1002?host=hh.ru"},"salary":{"from":3000,"to":5000,"currency":"USD","gross":false},"type":{"id":"open","name":"Открытая"},"address":{"city":"Минск","street":"улица Петра Мстиславца","building":"9","description":null,"lat":53.932908,"lng":27.649579,"raw":"Минск, улица Петра Мстиславца, 9","metro":{"station_name":"Восток","line_name":"Московская","station_id":"62.404","line_id":"62","lat":53.934509,"lng":27.651483},"metro_stations":[{"station_name":"Восток","line_name":"Московская","station_id":"62.404","line_id":"62","lat":53.934509,"lng":27.651483}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"flexible","name":"Гибкий график"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Evolution is a world-leading B2B provider of video-streamed Live Dealer gaming, committed to deliver a unique and flawless gameplay across multiple platforms through revolutionary product innovation. Firmly rooted in our values: ALIVE, do RIGHT and work TOGETHER, we are on a quest to lead the way in an industry which is pioneering technical solutions and pushing the limits of what has been done in terms of online user experience.</p> <p>Our services have won multiple industry awards, including &#39;Live Casino Supplier of the Year&#39; at the 2019 EGR B2B Awards for nine consecutive years and &#39;Casino Content Provider of the Year&#39; in the 2019 EGR North America Awards.</p> <p>Our success is largely down to the quality and commitment of our people. We are now looking for an experienced and driven Data Scientist. This is truly an exciting opportunity for a talented individual who is looking for a career opportunity in a dynamic and international work environment.</p> <p>Evolution Gaming Group AB (publ) was founded in 2006 and it is stock listed on the Swedish stock exchange Nasdaq. Today, about 7000 people work in the company&#39;s 14 sites, including locations like the U.S., Malta, Latvia, Georgia, Holland, Canada, Estonia, the U.K. and Sweden.</p> <p> </p> <p>We are searching for a passionate Data Scientist to help our risk and security departments to improve risk identification and fraud prevention through Machine Learning.</p> <p><strong>Main Duties &amp; Responsibilities:</strong></p> <ul> <li>Work with business and technical stakeholders to choose the most appropriate ML solutions;</li> <li>Design and develop machine learning models to support following use cases: <ul> <li>advantage play identification,</li> <li>fraud prevention,</li> <li>identification of suspicious user behavior patterns;</li> </ul> </li> <li>Work with data engineers to select appropriate datasets and data representation methods;</li> <li>Work with game developers to make sure that the necessary data are available;</li> <li>Research and implement appropriate ML algorithms and tools;</li> <li>Devise metrics and evaluation processes for the performance and impact of your models;</li> <li>Train, test and retrain machine learning models;</li> <li>Work with other teams to deploy machine learning models to production;</li> <li>Use and, where necessary, extend existing machine learning libraries and frameworks.</li> </ul> <p><strong>Qualifications:</strong></p> <ul> <li>University degree in numerical field (Machine Learning, Statistics, Mathematics, Computer Science, Physics, Engineering, etc.);</li> <li>Experience and understanding of linear algebra and statistical modelling;</li> <li>In-depth knowledge in at least one Machine Learning field such as regression, classification, clustering, pattern mining or optimization;</li> <li>Experience with at least one Machine Learning framework such as Scikit-Learn, Keras, Tensorflow, Pytorch, MLLib;</li> <li>Hands-on with Python, in particular packages such as Pandas, Numpy, Matplotlib (or equivalent);</li> <li>Experience with SQL and Big data tools such as Spark/Hive;</li> <li>Highly proficient in spoken and written English;</li> <li>Excellent communication skills and a pragmatic approach to problem solving;</li> <li>Willingness to learn and interest in latest trends in programming and machine learning.</li> </ul> <p><strong>Nice to Have:</strong></p> <ul> <li>Experience with designing and deploying machine learning pipelines to production;</li> <li>Knowledge of Scala or Java;</li> <li>Experience with Kafka, Clickhouse.</li> </ul> <p><strong>In return we offer</strong>:</p> <ul> <li>Net monthly salary 3000 USD - 5000 USD;</li> <li>Entrepreneur culture of the company, which allows you to try new approaches and technologies all the time;</li> <li>Recognition from the business which translates to very competitive salaries and a supportive attitude;</li> <li>Developing games featuring live video serving customers around the world;</li> <li>A healthy mix of startup-like culture of the company, which enables us to try new approaches and technologies and remain on the edge of technological development and enterprise, with stability and supporting functions to help you focus on your job;</li> <li>Modern and developer-friendly delivery processes, including Agile (Scrum / Kanban), JIRA issue tracking, Confluence wiki, GitLab source control, Jenkins continuous integration and delivery, modern hardware and software for development (an IDE of your choice);</li> <li>Being a part of an international team in a successful, publicly traded company;</li> <li>Health insurance, contemporary office environment, tech conference attendance, training, hackathons and other benefits and perks.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Machine Learning"},{"name":"Keras"},{"name":"Scikit-Learn"},{"name":"Tensorflow"},{"name":"Spark"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3984806","name":"Эволюшн Продактс Девелопмент","url":"https://api.hh.ru/employers/3984806?host=hh.ru","alternate_url":"https://hh.ru/employer/3984806","logo_urls":{"240":"https://hhcdn.ru/employer-logo/3565580.png","90":"https://hhcdn.ru/employer-logo/3565579.png","original":"https://hhcdn.ru/employer-logo-original/781172.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3984806&host=hh.ru","trusted":true},"published_at":"2020-11-18T12:49:14+0300","created_at":"2020-11-18T12:49:14+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=40496929","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/40496929","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}